
/* dx_timer.h : DoneX定时器头文件. Combo.xy */

#ifndef _DX_TIMER_H_
#define _DX_TIMER_H_

#include "../../h/donex.h"


#ifdef __cplusplus
extern "C" {
#endif


/********************************************************************************
 * 定时器初始化接口
 ********************************************************************************/
extern  void            dx_timer_init();


/********************************************************************************
 * 定时器定时触发接口
 ********************************************************************************/
extern  void            dx_timer_tick();


#ifdef __cplusplus
}
#endif

#endif /* #ifndef _DX_TIMER_H_ */
