
/* dx_config.h : DoneX配置头文件. Combo.xy */

#ifndef _DX_CONFIG_H_
#define _DX_CONFIG_H_


/********************************************************************************
 * [配置] DX_SCHED_WAY : 内核运行方式
 * 
 *  CPU优先: 优先利用CPU计算，来减少对内存的依赖,
 *           可以节约内存, 但CPU损耗增加;
 *  MEM优先: 优先利用内存缓存, 来减少对CPU的消耗,
 *           可以减低CPU消耗, 但内存占用高;
 *  自动优先: 找到中间的平衡点，自动使用
 ********************************************************************************/
#define DX_FIRST_AUT        0
#define DX_FIRST_MEM        1
#define DX_FIRST_CPU        2

#ifndef DX_SCHED_WAY
#define DX_SCHED_WAY        DX_FIRST_AUT /* DX_FIRST_AUT DX_FIRST_MEM DX_FIRST_CPU */
#endif
#if     DX_SCHED_WAY >      DX_FIRST_CPU
#error 'DX_SCHED_WAY' config error!
#endif
/********************************************************************************/


/********************************************************************************
 * [配置] DX_PRIO_MAX : 最大优先级
 ********************************************************************************/
#ifndef DX_PRIO_MAX
#define DX_PRIO_MAX         255 /* 63 127 255 */
#endif
#if     DX_PRIO_MAX >       255
#error 'DX_PRIO_MAX' defined error!
#endif
/********************************************************************************/


/********************************************************************************
 * [配置] DX_CPU_MAX : CPU Core最大个数 (实际个数由适配接口返回)
 ********************************************************************************/
#ifndef DX_CPU_MAX                                              /* CPU核心数 */
#define DX_CPU_MAX          1
#endif
#ifndef DX_CPU_BITS                                             /* CPU位宽 */
#define DX_CPU_BITS         32                                  /* 8 16 32 64 */
#endif
/********************************************************************************/


/********************************************************************************
 * [配置] DX_INT_MAX : 中断最大个数
 ********************************************************************************/
#ifndef DX_INT_MAX
#define DX_INT_MAX          16
#endif
/********************************************************************************/


/********************************************************************************
 * [配置] 任务属性
 ********************************************************************************/
#ifndef DX_TASK_NAME_MAX                                        /* 任务名字最大长度 */
#define DX_TASK_NAME_MAX    16                                  /* (不使用任务名字就设为0) */
#endif
#ifndef DX_TASK_VAR_MAX                                         /* 任务变量最大数量 */
#define DX_TASK_VAR_MAX     8                                   /* (不使用任务变量就设为0) */
#endif
/********************************************************************************/


#endif /* #ifndef _DX_CONFIG_H_ */
